---
kind: other
id: Methods.T:Autodesk.Revit.DB.NamingUtils
source: html/f8e0e5eb-fdf3-f72f-7d59-4f416a7e312e.htm
---
# NamingUtils Methods

Compares two object name strings using Revit's comparison rules.